# pandas ~~vs~~and SQL

pandas != SQL

SQL most often is OLTP with concurrency and scale

pandas is data analytics, easy and fast

* can't compare and doesn't compete
* move data from/to

https://github.com/Nozdi/first-steps-with-pandas-workshop

In [3]:
# pip install pandas, jupyter, ipython-sql, sqlalchemy, psycopg2

%load_ext sql

# createuser -s -P pandas
# createdb -O pandas pandas

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%%sql postgresql://pandas:pandas@localhost/pandas
        select version();

1 rows affected.

[('PostgreSQL 9.6.5 on x86_64-pc-linux-gnu, compiled by gcc (GCC) 7.1.1 20170630, 64-bit',)]

In [5]:
import numpy as np
import pandas as pd
print('pandas: ' + pd.__version__)

pandas: 0.20.2

In [6]:
strengths = pd.Series([400, 200, 300, 400, 500])
strengths

0    400
1    200
2    300
3    400
4    500
dtype: int64

In [7]:
%sql SELECT unnest(array[400, 200, 300, 400, 500]) AS strength

5 rows affected.

[(400,), (200,), (300,), (400,), (500,)]

In [8]:
names = pd.Series(["Batman", "Robin", "Spiderman", "Robocop", "Terminator"])

In [9]:
result = %sql SELECT a.name FROM (VALUES ('Batman'), ('Robin'), ('Spiderman'), ('Robocop'), ('Terminator')) AS a(name)

5 rows affected.

In [10]:
heroes = pd.DataFrame({
    'hero': names,
    'strength': strengths
})
heroes

         hero  strength
0      Batman       400
1       Robin       200
2   Spiderman       300
3     Robocop       400
4  Terminator       500

In [11]:
%%sql
CREATE TABLE IF NOT EXISTS heroes (name text, strength int);
TRUNCATE heroes;
INSERT INTO heroes VALUES ('Batman', 400), ('Robin', 200), ('Spiderman', 300), ('Robocop', 400), ('Terminator', 500)
  RETURNING *;

Done.
Done.
5 rows affected.

[('Batman', 400),
 ('Robin', 200),
 ('Spiderman', 300),
 ('Robocop', 400),
 ('Terminator', 500)]

In [12]:
another_heroes = pd.DataFrame([
    pd.Series(["Wonder Woman", 10, 3], index=["hero", "strength", "cookies"]),
    pd.Series(["Xena", 20, 0], index=["hero", "strength", "cookies"])
])

In [13]:
result = %sql CREATE TABLE IF NOT EXISTS another_heroes AS SELECT *, (random() * 10)::int AS cookies FROM heroes LIMIT 2;

2 rows affected.

In [15]:
pd.read_json('data/cached_python.json')

            daily_views   month project  rank                          title
2016-01-01         2701  201601      en  2251  Python_(programming_language)
2016-01-02         2829  201601      en  2251  Python_(programming_language)
2016-01-03         2773  201601      en  2251  Python_(programming_language)
2016-01-04         5072  201601      en  2251  Python_(programming_language)
2016-01-05         5513  201601      en  2251  Python_(programming_language)
2016-01-06         5233  201601      en  2251  Python_(programming_language)
2016-01-07         5518  201601      en  2251  Python_(programming_language)
2016-01-08         5312  201601      en  2251  Python_(programming_language)
2016-01-09         2749  201601      en  2251  Python_(programming_language)
2016-01-10         2989  201601      en  2251  Python_(programming_language)
2016-01-11         5539  201601      en  2251  Python_(programming_language)
2016-01-12         6161  201601      en  2251  Python_(programming_language)
2016-01-13         6175  201601      en  2251  Python_(programming_language)
2016-01-14         5545  201601      en  2251  Python_(programming_language)
2016-01-15         4833  201601      en  2251  Python_(programming_language)
2016-01-16         2858  201601      en  2251  Python_(programming_language)
2016-01-17         2992  201601      en  2251  Python_(programming_language)
2016-01-18         4673  201601      en  2251  Python_(programming_language)
2016-01-19         5625  201601      en  2251  Python_(programming_language)
2016-01-20         5450  201601      en  2251  Python_(programming_language)

In [21]:
%%sql
CREATE TABLE IF NOT EXISTS cached_python (doc json);
COPY cached_python FROM '/var/lib/postgres/tmp/cached_python.json';

CREATE TABLE IF NOT EXISTS daily_stats AS
  SELECT to_timestamp(v.key::bigint / 1000) AS ts,
    v.value as daily_views,
    m.value as month,
    p.value as project,
    r.value as rank,
    t.value as title
    FROM cached_python
    CROSS JOIN LATERAL json_each(doc->'daily_views') v
    JOIN LATERAL json_each(doc->'month') m ON m.key = v.key
    JOIN LATERAL json_each(doc->'project') p ON p.key = v.key
    JOIN LATERAL json_each(doc->'rank') r ON r.key = v.key
    JOIN LATERAL json_each(doc->'title') t ON t.key = v.key;
SELECT * FROM daily_stats;

Done.
1 rows affected.
40 rows affected.
40 rows affected.

[(datetime.datetime(2016, 1, 1, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2701, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 2, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2829, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 3, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2773, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 4, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5072, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 5, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5513, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 6, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5233, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 7, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5518, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 8, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5312, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 9, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2749, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 10, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2989, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 11, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5539, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 12, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 6161, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 13, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 6175, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 14, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5545, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 15, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 4833, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 16, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2858, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 17, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2992, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 18, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 4673, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 19, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5625, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 20, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5450, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 1, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2701, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 2, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2829, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 3, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2773, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 4, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5072, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 5, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5513, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 6, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5233, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 7, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5518, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 8, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5312, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 9, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2749, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 10, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2989, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 11, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5539, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 12, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 6161, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 13, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 6175, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 14, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5545, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 15, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 4833, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 16, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2858, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 17, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 2992, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 18, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 4673, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 19, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5625, 201601, 'en', 2251, 'Python_(programming_language)'),
 (datetime.datetime(2016, 1, 20, 1, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), 5450, 201601, 'en', 2251, 'Python_(programming_language)')]

In [22]:
movies = pd.read_csv('data/movies.csv')
movies.head()

,movie_title,title_year,budget,gross,genres,language,country,movie_facebook_likes,imdb_score,num_voted_users,...,actor_3_name,actor_3_facebook_likes,cast_total_facebook_likes,color,duration,plot_keywords,content_rating,aspect_ratio,facenumber_in_poster,movie_imdb_link
0,Avatar,2009.0,237000000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,English,USA,33000,7.9,886204,...,Wes Studi,855.0,4834,Color,178.0,avatar|future|marine|native|paraplegic,PG-13,1.78,0.0,http://www.imdb.com/title/tt0499549/?ref_=fn_t...
1,Pirates of the Caribbean: At World's End,2007.0,300000000.0,309404152.0,Action|Adventure|Fantasy,English,USA,0,7.1,471220,...,Jack Davenport,1000.0,48350,Color,169.0,goddess|marriage ceremony|marriage proposal|pi...,PG-13,2.35,0.0,http://www.imdb.com/title/tt0449088/?ref_=fn_t...
2,Spectre,2015.0,245000000.0,200074175.0,Action|Adventure|Thriller,English,UK,85000,6.8,275868,...,Stephanie Sigman,161.0,11700,Color,148.0,bomb|espionage|sequel|spy|terrorist,PG-13,2.35,1.0,http://www.imdb.com/title/tt2379713/?ref_=fn_t...
3,The Dark Knight Rises,2012.0,250000000.0,448130642.0,Action|Thriller,English,USA,164000,8.5,1144337,...,Joseph Gordon-Levitt,23000.0,106759,Color,164.0,deception|imprisonment|lawlessness|police offi...,PG-13,2.35,0.0,http://www.imdb.com/title/tt1345836/?ref_=fn_t...
4,Star Wars: Episode VII - The Force Awakens,NaN,NaN,NaN,Documentary,NaN,NaN,0,7.1,8,...,NaN,NaN,143,NaN,NaN,NaN,NaN,NaN,0.0,http://www.imdb.com/title/tt5289954/?ref_=fn_t...

In [24]:
%%sql
CREATE TABLE IF NOT EXISTS movies (
    movie_title varchar,
    title_year numeric(4,0),
    budget numeric(14,2),
    gross numeric(14,2),
    genres varchar,
    language varchar,
    country varchar,
    movie_facebook_likes int,
    imdb_score numeric(2,1),
    num_voted_users int,
    num_critic_for_reviews numeric(6,0),
    num_user_for_reviews numeric(6,0),
    director_name varchar,
    director_facebook_likes numeric(9,0),
    actor_1_name varchar,
    actor_1_facebook_likes numeric(9,0),
    actor_2_name varchar,
    actor_2_facebook_likes numeric(9,0),
    actor_3_name varchar,
    actor_3_facebook_likes numeric(9,0),
    cast_total_facebook_likes numeric(9,0),
    color varchar,
    duration numeric(4,0),
    plot_keywords varchar,
    content_rating varchar,
    aspect_ratio numeric (4,2),
    facenumber_in_poster numeric(2,0),
    movie_imdb_link varchar
);

COPY movies FROM '/var/lib/postgres/tmp/movies.csv' csv header;

Done.
5043 rows affected.

[]

In [25]:
heroes.to_json(orient='records')

'[{"hero":"Batman","strength":400},{"hero":"Robin","strength":200},{"hero":"Spiderman","strength":300},{"hero":"Robocop","strength":400},{"hero":"Terminator","strength":500}]'

In [26]:
%sql SELECT array_to_json(array_agg(row_to_json(a))) FROM (SELECT * FROM heroes LIMIT 5) a

1 rows affected.

[([{'name': 'Batman', 'strength': 400}, {'name': 'Robin', 'strength': 200}, {'name': 'Spiderman', 'strength': 300}, {'name': 'Robocop', 'strength': 400}, {'name': 'Terminator', 'strength': 500}],)]

In [28]:
heroes.to_csv('data/heroes.csv', index=False)

In [27]:
%sql COPY heroes TO '/var/lib/postgres/tmp/heroes.csv' csv header;

5 rows affected.

[]

In [29]:
heroes[heroes['strength'] > 400]

         hero  strength
4  Terminator       500

In [30]:
%sql SELECT * FROM heroes WHERE strength > 400

1 rows affected.

[('Terminator', 500)]

In [31]:
try:
    heroes[200 < heroes['strength'] < 400]
except ValueError:
    print("This cool Python syntax ain't work :(")
    
heroes[
    (heroes['strength'] > 200) & 
    (heroes['strength'] < 400)
]

This cool Python syntax ain't work :(

        hero  strength
2  Spiderman       300

In [33]:
%sql SELECT * FROM heroes WHERE strength BETWEEN 201 AND 399

1 rows affected.

[('Spiderman', 300)]

In [34]:
heroes[
    heroes['hero'].isin(['Batman', 'Robin'])
].sort_values('strength', ascending=False)

     hero  strength
0  Batman       400
1   Robin       200

In [35]:
%sql SELECT * FROM heroes WHERE name IN ('Batman', 'Robin') ORDER BY strength DESC

2 rows affected.

[('Batman', 400), ('Robin', 200)]

In [36]:
heroes

         hero  strength
0      Batman       400
1       Robin       200
2   Spiderman       300
3     Robocop       400
4  Terminator       500

In [37]:
heroes.T

               0      1          2        3           4
hero      Batman  Robin  Spiderman  Robocop  Terminator
strength     400    200        300      400         500

In [38]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                      'foo', 'foo', 'qux', 'qux'],
                     ['one', 'two', 'one', 'two',
                      'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -2.168470  0.461053
      two    -1.200270 -0.083261
baz   one    -0.847412 -0.359428
      two    -0.322426  0.039667
foo   one     0.074351  2.831533
      two    -1.374124  0.950575
qux   one    -0.589160  0.464742
      two    -1.060498 -2.080155

In [39]:
df.stack()

first  second
bar    one     A   -2.168470
               B    0.461053
       two     A   -1.200270
               B   -0.083261
baz    one     A   -0.847412
               B   -0.359428
       two     A   -0.322426
               B    0.039667
foo    one     A    0.074351
               B    2.831533
       two     A   -1.374124
               B    0.950575
qux    one     A   -0.589160
               B    0.464742
       two     A   -1.060498
               B   -2.080155
dtype: float64

In [40]:
heroes['health'] = 100
heroes['height'] = [180, 170, 175, 190, 185]
heroes['is_hungry'] = pd.Series([True, False, False, True, True])
heroes.head()

         hero  strength  health  height  is_hungry
0      Batman       400     100     180       True
1       Robin       200     100     170      False
2   Spiderman       300     100     175      False
3     Robocop       400     100     190       True
4  Terminator       500     100     185       True

In [43]:
%%sql
ALTER TABLE heroes ADD COLUMN health int;
ALTER TABLE heroes ADD COLUMN height int;
UPDATE heroes SET health = 100;
UPDATE heroes SET height = h.column2
FROM (VALUES ('Batman', 180), ('Robin', 170), ('Spiderman', 175), ('Robocop', 190), ('Terminator', 185)) h
WHERE name = h.column1 RETURNING heroes.*;

5 rows affected.
5 rows affected.

[('Batman', 400, 100, 180),
 ('Robin', 200, 100, 170),
 ('Spiderman', 300, 100, 175),
 ('Robocop', 400, 100, 190),
 ('Terminator', 500, 100, 185)]

In [44]:
heroes['strength'] / heroes['height']

0    2.222222
1    1.176471
2    1.714286
3    2.105263
4    2.702703
dtype: float64

In [45]:
heroes['strength_per_cm'] = heroes['strength'] / heroes['height']

In [46]:
%%sql
ALTER TABLE heroes ADD COLUMN strength_per_cm double precision;
UPDATE heroes SET strength_per_cm = strength::double precision / height
  RETURNING *;

Done.
5 rows affected.

[('Batman', 400, 100, 180, 2.22222222222222),
 ('Robin', 200, 100, 170, 1.17647058823529),
 ('Spiderman', 300, 100, 175, 1.71428571428571),
 ('Robocop', 400, 100, 190, 2.10526315789474),
 ('Terminator', 500, 100, 185, 2.7027027027027)]

In [47]:
heroes['code'] = heroes['hero'].map(lambda name: name[:2])
heroes['effective_strength'] = heroes.apply(
    lambda row: (not row['is_hungry']) * row['strength'],
    axis=1
)
heroes[['health', 'strength']] = heroes[['health', 'strength']].applymap(
    lambda x: x + 100
)
heroes

,hero,strength,health,height,is_hungry,strength_per_cm,code,effective_strength
0,Batman,500,200,180,True,2.222222,Ba,0
1,Robin,300,200,170,False,1.176471,Ro,200
2,Spiderman,400,200,175,False,1.714286,Sp,300
3,Robocop,500,200,190,True,2.105263,Ro,0
4,Terminator,600,200,185,True,2.702703,Te,0

In [48]:
movies['first_genre'] = movies['genres'].str.split('|').str[0]
movies[['first_genre', 'genres']].head()

   first_genre                           genres
0       Action  Action|Adventure|Fantasy|Sci-Fi
1       Action         Action|Adventure|Fantasy
2       Action        Action|Adventure|Thriller
3       Action                  Action|Thriller
4  Documentary                      Documentary

In [49]:
%sql SELECT (string_to_array(genres, '|'))[1], genres FROM movies LIMIT 5

5 rows affected.

[('Action', 'Action|Adventure|Fantasy|Sci-Fi'),
 ('Action', 'Action|Adventure|Fantasy'),
 ('Action', 'Action|Adventure|Thriller'),
 ('Action', 'Action|Thriller'),
 ('Documentary', 'Documentary')]

In [50]:
movies.groupby('title_year')['gross'].max().tail(10)

title_year
2007.0    336530303.0
2008.0    533316061.0
2009.0    760505847.0
2010.0    414984497.0
2011.0    352358779.0
2012.0    623279547.0
2013.0    424645577.0
2014.0    350123553.0
2015.0    652177271.0
2016.0    407197282.0
Name: gross, dtype: float64

In [51]:
%%sql
SELECT * FROM (
  SELECT title_year, max(gross)
  FROM movies
  GROUP BY title_year
) a
WHERE title_year IS NOT NULL
ORDER BY title_year DESC
LIMIT 10

10 rows affected.

[(Decimal('2016'), Decimal('407197282.00')),
 (Decimal('2015'), Decimal('652177271.00')),
 (Decimal('2014'), Decimal('350123553.00')),
 (Decimal('2013'), Decimal('424645577.00')),
 (Decimal('2012'), Decimal('623279547.00')),
 (Decimal('2011'), Decimal('352358779.00')),
 (Decimal('2010'), Decimal('414984497.00')),
 (Decimal('2009'), Decimal('760505847.00')),
 (Decimal('2008'), Decimal('533316061.00')),
 (Decimal('2007'), Decimal('336530303.00'))]

In [53]:
spiderman_meals = pd.DataFrame([
        dict(time='2016-10-15 10:00', calories=300),
        dict(time='2016-10-15 13:00', calories=900),
        dict(time='2016-10-15 15:00', calories=1200),
        dict(time='2016-10-15 21:00', calories=700),
        dict(time='2016-10-16 07:00', calories=1600),
        dict(time='2016-10-16 13:00', calories=600),
        dict(time='2016-10-16 16:00', calories=900),
        dict(time='2016-10-16 20:00', calories=500),
        dict(time='2016-10-16 21:00', calories=300),
        dict(time='2016-10-17 08:00', calories=900),
    ])
spiderman_meals['time'] = pd.to_datetime(spiderman_meals['time'])
spiderman_meals = spiderman_meals.set_index('time')
spiderman_meals

                     calories
time
2016-10-15 10:00:00       300
2016-10-15 13:00:00       900
2016-10-15 15:00:00      1200
2016-10-15 21:00:00       700
2016-10-16 07:00:00      1600
2016-10-16 13:00:00       600
2016-10-16 16:00:00       900
2016-10-16 20:00:00       500
2016-10-16 21:00:00       300
2016-10-17 08:00:00       900

In [54]:
%%sql
CREATE TABLE IF NOT EXISTS spiderman_meals AS
  SELECT * FROM (
  VALUES
    ('2016-10-15 10:00'::timestamp, 300),
    ('2016-10-15 13:00'::timestamp, 900),
    ('2016-10-15 15:00'::timestamp, 1200),
    ('2016-10-15 21:00'::timestamp, 700),
    ('2016-10-16 07:00'::timestamp, 1600),
    ('2016-10-16 13:00'::timestamp, 600),
    ('2016-10-16 16:00'::timestamp, 900),
    ('2016-10-16 20:00'::timestamp, 500),
    ('2016-10-16 21:00'::timestamp, 300),
    ('2016-10-17 08:00'::timestamp, 900)
  ) AS t (ts, calories);
SELECT * FROM spiderman_meals;

Done.
10 rows affected.

[(datetime.datetime(2016, 10, 15, 10, 0), 300),
 (datetime.datetime(2016, 10, 15, 13, 0), 900),
 (datetime.datetime(2016, 10, 15, 15, 0), 1200),
 (datetime.datetime(2016, 10, 15, 21, 0), 700),
 (datetime.datetime(2016, 10, 16, 7, 0), 1600),
 (datetime.datetime(2016, 10, 16, 13, 0), 600),
 (datetime.datetime(2016, 10, 16, 16, 0), 900),
 (datetime.datetime(2016, 10, 16, 20, 0), 500),
 (datetime.datetime(2016, 10, 16, 21, 0), 300),
 (datetime.datetime(2016, 10, 17, 8, 0), 900)]

In [55]:
spiderman_meals["2016-10-15"]

                     calories
time
2016-10-15 10:00:00       300
2016-10-15 13:00:00       900
2016-10-15 15:00:00      1200
2016-10-15 21:00:00       700

In [56]:
%sql SELECT * FROM spiderman_meals WHERE date_trunc('day', ts) = '2016-10-15'

4 rows affected.

[(datetime.datetime(2016, 10, 15, 10, 0), 300),
 (datetime.datetime(2016, 10, 15, 13, 0), 900),
 (datetime.datetime(2016, 10, 15, 15, 0), 1200),
 (datetime.datetime(2016, 10, 15, 21, 0), 700)]

In [57]:
spiderman_meals.resample('1D').sum()

            calories
time
2016-10-15      3100
2016-10-16      3900
2016-10-17       900

In [58]:
%sql SELECT date_trunc('day', ts), sum(calories) FROM spiderman_meals GROUP BY 1 ORDER BY 1

3 rows affected.

[(datetime.datetime(2016, 10, 15, 0, 0), 3100),
 (datetime.datetime(2016, 10, 16, 0, 0), 3900),
 (datetime.datetime(2016, 10, 17, 0, 0), 900)]

In [59]:
spiderman_meals.resample('1H').mean().head()

                     calories
time
2016-10-15 10:00:00     300.0
2016-10-15 11:00:00       NaN
2016-10-15 12:00:00       NaN
2016-10-15 13:00:00     900.0
2016-10-15 14:00:00       NaN

In [60]:
%%sql
SELECT t, m.calories
FROM (SELECT min(ts), max(ts) FROM spiderman_meals) s
CROSS JOIN LATERAL generate_series(s.min, s.max, '1 hour'::interval) t
LEFT JOIN spiderman_meals m ON m.ts = t
LIMIT 5

5 rows affected.

[(datetime.datetime(2016, 10, 15, 10, 0), 300),
 (datetime.datetime(2016, 10, 15, 11, 0), None),
 (datetime.datetime(2016, 10, 15, 12, 0), None),
 (datetime.datetime(2016, 10, 15, 13, 0), 900),
 (datetime.datetime(2016, 10, 15, 14, 0), None)]

In [64]:
spiderman_meals.resample('1H').ffill().head(10)

                     calories
time
2016-10-15 10:00:00       300
2016-10-15 11:00:00       300
2016-10-15 12:00:00       300
2016-10-15 13:00:00       900
2016-10-15 14:00:00       900
2016-10-15 15:00:00      1200
2016-10-15 16:00:00      1200
2016-10-15 17:00:00      1200
2016-10-15 18:00:00      1200
2016-10-15 19:00:00      1200

In [65]:
%%sql
SELECT t, first_value(calories) OVER (PARTITION BY value_partition ORDER BY t)
FROM (
  SELECT t, m.calories, sum(m.calories) OVER (ORDER BY t) AS value_partition
  FROM (SELECT min(ts), max(ts) FROM spiderman_meals) s
  CROSS JOIN LATERAL generate_series(s.min, s.max, '1 hour'::interval) t
  LEFT JOIN spiderman_meals m ON m.ts = t
) a
LIMIT 10

10 rows affected.

[(datetime.datetime(2016, 10, 15, 10, 0), 300),
 (datetime.datetime(2016, 10, 15, 11, 0), 300),
 (datetime.datetime(2016, 10, 15, 12, 0), 300),
 (datetime.datetime(2016, 10, 15, 13, 0), 900),
 (datetime.datetime(2016, 10, 15, 14, 0), 900),
 (datetime.datetime(2016, 10, 15, 15, 0), 1200),
 (datetime.datetime(2016, 10, 15, 16, 0), 1200),
 (datetime.datetime(2016, 10, 15, 17, 0), 1200),
 (datetime.datetime(2016, 10, 15, 18, 0), 1200),
 (datetime.datetime(2016, 10, 15, 19, 0), 1200)]

In [66]:
spiderman_meals.resample('1D').first()

            calories
time
2016-10-15       300
2016-10-16      1600
2016-10-17       900

In [67]:
%%sql
SELECT DISTINCT
  date_trunc('day', m.ts),
  first_value(m.calories) OVER (PARTITION BY date_trunc('day', m.ts) ORDER BY m.ts)
FROM spiderman_meals m
ORDER BY 1

3 rows affected.

[(datetime.datetime(2016, 10, 15, 0, 0), 300),
 (datetime.datetime(2016, 10, 16, 0, 0), 1600),
 (datetime.datetime(2016, 10, 17, 0, 0), 900)]

In [52]:
movies.describe()

,title_year,budget,gross,movie_facebook_likes,imdb_score,num_voted_users,num_critic_for_reviews,num_user_for_reviews,director_facebook_likes,actor_1_facebook_likes,actor_2_facebook_likes,actor_3_facebook_likes,cast_total_facebook_likes,duration,aspect_ratio,facenumber_in_poster
count,4935.000000,4.551000e+03,4.159000e+03,5043.000000,5043.000000,5.043000e+03,4993.000000,5022.000000,4939.000000,5036.000000,5030.000000,5020.000000,5043.000000,5028.000000,4714.000000,5030.000000
mean,2002.470517,3.975262e+07,4.846841e+07,7525.964505,6.442138,8.366816e+04,140.194272,272.770808,686.509212,6560.047061,1651.754473,645.009761,9699.063851,107.201074,2.220403,1.371173
std,12.474599,2.061149e+08,6.845299e+07,19320.445110,1.125116,1.384853e+05,121.601675,377.982886,2813.328607,15020.759120,4042.438863,1665.041728,18163.799124,25.197441,1.385113,2.013576
min,1916.000000,2.180000e+02,1.620000e+02,0.000000,1.600000,5.000000e+00,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,7.000000,1.180000,0.000000
25%,1999.000000,6.000000e+06,5.340988e+06,0.000000,5.800000,8.593500e+03,50.000000,65.000000,7.000000,614.000000,281.000000,133.000000,1411.000000,93.000000,1.850000,0.000000
50%,2005.000000,2.000000e+07,2.551750e+07,166.000000,6.600000,3.435900e+04,110.000000,156.000000,49.000000,988.000000,595.000000,371.500000,3090.000000,103.000000,2.350000,1.000000
75%,2011.000000,4.500000e+07,6.230944e+07,3000.000000,7.200000,9.630900e+04,195.000000,326.000000,194.500000,11000.000000,918.000000,636.000000,13756.500000,118.000000,2.350000,2.000000
max,2016.000000,1.221550e+10,7.605058e+08,349000.000000,9.500000,1.689764e+06,813.000000,5060.000000,23000.000000,640000.000000,137000.000000,23000.000000,656730.000000,511.000000,16.000000,43.000000

In [59]:
%sql SELECT * FROM describe('movies')

(psycopg2.ProgrammingError) BŁĄD:  funkcja describe(unknown) nie istnieje
LINE 1: SELECT * FROM describe('movies')
                      ^
HINT:  Brak funkcji pasującej do podanej nazwy i typów argumentów. Być może należy dodać jawne rzutowanie typów.
 [SQL: "SELECT * FROM describe('movies')"]

In [53]:
%%sql
CREATE TYPE attr_stats AS (
  attname name,
  count int,
  mean double precision,
  std double precision,
  min double precision,
  p025 double precision,
  p050 double precision,
  p075 double precision,
  max double precision
);

Done.

[]

In [55]:
%%sql
CREATE FUNCTION describe(_table text) RETURNS SETOF attr_stats AS $$
DECLARE
  _query text;
  _result attr_stats;
BEGIN
  SELECT INTO _query 'SELECT (b.a).* FROM (SELECT UNNEST(ARRAY[' || array_to_string(array_agg(format('
      (''%s'',
      COUNT(%s),
      AVG(%s::double precision),
      STDDEV_SAMP(%s::double precision),
      MIN(%s::double precision),
      (PERCENTILE_DISC(0.25) WITHIN GROUP (ORDER BY %s))::double precision,
      (PERCENTILE_DISC(0.50) WITHIN GROUP (ORDER BY %s))::double precision,
      (PERCENTILE_DISC(0.75) WITHIN GROUP (ORDER BY %s))::double precision,
      MAX(%s::double precision))::attr_stats',
    a.attname, a.attname, a.attname, a.attname, a.attname, a.attname, a.attname, a.attname, a.attname)), ', ') || ']) a FROM ' || _table || ') b'
  FROM pg_attribute a
  JOIN pg_type t ON t.oid = a.atttypid
  WHERE a.attrelid = _table::regclass AND t.typcategory = 'N' AND t.typname != 'oid';

  RAISE NOTICE 'Executing following query: %', _query;

  FOR _result IN EXECUTE _query LOOP
    RETURN NEXT _result;
  END LOOP;

  RETURN;
END;
$$ LANGUAGE PLPGSQL STRICT;

Done.

[]

In [57]:
%sql SELECT * FROM describe('movies')

16 rows affected.

[('num_voted_users', 5043, 83668.160816974, 138485.256805962, 5.0, 8589.0, 34359.0, 96385.0, 1689764.0),
 ('movie_facebook_likes', 5043, 7525.96450525481, 19320.4451099466, 0.0, 0.0, 166.0, 3000.0, 349000.0),
 ('facenumber_in_poster', 5030, 1.37117296222664, 2.0135759199961, 0.0, 0.0, 1.0, 2.0, 43.0),
 ('aspect_ratio', 4714, 2.22040305473078, 1.38511253530293, 1.18, 1.85, 2.35, 2.35, 16.0),
 ('duration', 5028, 107.20107398568, 25.1974408088242, 7.0, 93.0, 103.0, 118.0, 511.0),
 ('cast_total_facebook_likes', 5043, 9699.06385088241, 18163.7991240459, 0.0, 1411.0, 3090.0, 13761.0, 656730.0),
 ('actor_3_facebook_likes', 5020, 645.009760956175, 1665.04172844586, 0.0, 133.0, 371.0, 636.0, 23000.0),
 ('actor_2_facebook_likes', 5030, 1651.75447316103, 4042.43886264187, 0.0, 281.0, 595.0, 918.0, 137000.0),
 ('actor_1_facebook_likes', 5036, 6560.04706115965, 15020.7591199841, 0.0, 614.0, 988.0, 11000.0, 640000.0),
 ('director_facebook_likes', 4939, 686.509212391172, 2813.32860686567, 0.0, 7.0, 49.0, 195.0, 23000.0),
 ('num_user_for_reviews', 5022, 272.770808442851, 377.982885565769, 1.0, 65.0, 156.0, 326.0, 5060.0),
 ('num_critic_for_reviews', 4993, 140.194271980773, 121.601675396231, 1.0, 50.0, 110.0, 195.0, 813.0),
 ('imdb_score', 5043, 6.44213761649811, 1.12511586573289, 1.6, 5.8, 6.6, 7.2, 9.5),
 ('gross', 4159, 48468407.5268093, 68452990.4387532, 162.0, 5333658.0, 25517500.0, 62318875.0, 760505847.0),
 ('budget', 4551, 39752620.4363876, 206114898.448684, 218.0, 6000000.0, 20000000.0, 45000000.0, 12215500000.0),
 ('title_year', 4935, 2002.47051671733, 12.4745989192707, 1916.0, 1999.0, 2005.0, 2011.0, 2016.0)]

Links:

* https://pandas.pydata.org/pandas-docs/stable/comparison_with_sql.html
* https://github.com/Nozdi/first-steps-with-pandas-workshop
* https://medium.com/carwow-product-engineering/sql-vs-pandas-how-to-balance-tasks-between-server-and-client-side-9e2f6c95677

Questions?